sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/createLead.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.createLead">
   <soapenv:Header/>
    <soapenv:Body>
    		<sug:sugarCRMApiUrl>https://ypbvhe6054.trial.sugarcrm.com/soap.php</sug:sugarCRMApiUrl>    	
    	   	<sug:user_name>admin</sug:user_name>    	   
    	    	<sug:password>D53501408C32F5547DAB93DCD277191E</sug:password>
    	     <sug:first_name>Dun</sug:first_name>
    	     <sug:last_name>Dull</sug:last_name>
    	     <sug:email_address>Dun@gmail.com</sug:email_address>
    	</soapenv:Body>
</soapenv:Envelope>